tap "nikitabobko/tap" # Aerospace
tap "jorgerojas26/lazysql" 

# CLI Tools
brew "mas"           # Mac App Store CLI for automated app installation
brew "git"
brew "fzf"
brew "ripgrep"
brew "bat"
brew "htop"
brew "lazygit"
brew "jorgerojas26/lazysql/lazysql"
brew "awscli"
brew "jq"
brew "yq"
brew "gh"
brew "delta"
brew "tmux"
brew "stow"
brew "neovim"
brew "kubectl"       # Kubernetes CLI
brew "tailscale"     # Secure mesh VPN for homelab and remote access

# Languages n stuff
brew "python"
brew "pipx"
brew "node"
brew "nvm"

# GNU Utilities
brew "coreutils"
brew "gnu-sed"
brew "findutils"
brew "gawk"

# GUI Applications
cask "visual-studio-code"
cask "raycast"
# cask "docker"      # Docker Desktop - disabled in favor of OrbStack
cask "orbstack"      # Faster, lighter Docker alternative
cask "ghostty"
cask "nikitabobko/tap/aerospace"
cask "discord"
cask "firefox"
cask "shottr" 
cask "notion"
cask "spotify"
cask "protonvpn"
cask "proton-drive"
cask "proton-mail"
cask "proton-pass"
cask "forklift"
cask "netnewswire"
cask "ollama"
cask "warp"
cask "wifiman"
cask "sublime-text"
cask "claude"
cask "claude-code"
cask "postman"

# Fonts
cask "font-jetbrains-mono-nerd-font"

# Mac App Store Apps
# Note: You must be signed into the App Store for mas to work
# Find app IDs with: mas search "App Name"
# List installed apps: mas list
mas "Perplexity: Ask Anything", id: 6714467650
mas "Supernote Partner", id: 1494992020
mas "Calendars – agenda et rappels", id: 608834326
mas "Toggl Track: Hours & Time Log", id: 1291898086

